nxp-mcuxpresso/mcuxsdk-examples/_boards/rdrw612bga/common/pin_mux/pin_mux.c
    MCI_IO_MUX->GPIO_GRP0 = ((MCI_IO_MUX->GPIO_GRP0 &
                              /* Mask bits to zero which are setting */
                              (~(MCI_IO_MUX_GPIO_GRP0_SEL_13_MASK | MCI_IO_MUX_GPIO_GRP0_SEL_14_MASK)))

                             /* pio0[31:0] selection, high valid; sel[i]->pio0[i]->GPIO[i]: 0x00u */
                             | MCI_IO_MUX_GPIO_GRP0_SEL(0x00u));

    SOCCTRL->MCI_IOMUX_EN0 = ((SOCCTRL->MCI_IOMUX_EN0 &
                               /* Mask bits to zero which are setting */
                               (~(SOCCIU_MCI_IOMUX_EN0_EN_21_0_13_MASK | SOCCIU_MCI_IOMUX_EN0_EN_21_0_14_MASK)))

                              /* Bitwise enable control for mci_io_mux GPIO[21:0]: 0x00u */
                              | SOCCIU_MCI_IOMUX_EN0_EN_21_0(0x00u));
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitLEDsPins:
- options: {callFromInitBoot: 'false', prefix: BOARD_, coreID: cm33, enableClock: 'true'}
- pin_list: []
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitLEDsPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 */
void BOARD_InitLEDsPins(void)
{
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitBUTTONsPins:
- options: {callFromInitBoot: 'false', prefix: BOARD_, coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: E7, peripheral: GPIO, signal: 'PIO0, 25', pin_signal: GPIO_25, direction: INPUT, gpio_interrupt_a_enable: enabled, gpio_interrupt_config: gpioIrqFallingEdge}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBUTTONsPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 */
void BOARD_InitBUTTONsPins(void)
{
    /* Enables the clock for the GPIO0 module */
    GPIO_PortInit(GPIO, 0);

    gpio_pin_config_t SW2_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    gpio_interrupt_config_t SW2_int_config = {
        .mode = kGPIO_PinIntEnableEdge,
        .polarity = kGPIO_PinIntEnableLowOrFall
    };
    /* Initialize GPIO functionality on pin PIO0_25 (pin E7)  */
    GPIO_PinInit(BOARD_SW2_GPIO, BOARD_SW2_PORT, BOARD_SW2_PIN, &SW2_config);
    GPIO_SetPinInterruptConfig(BOARD_SW2_GPIO, BOARD_SW2_PORT, BOARD_SW2_PIN, &SW2_int_config);
    GPIO_PinEnableInterrupt(BOARD_SW2_GPIO, BOARD_SW2_PORT, BOARD_SW2_PIN, (uint32_t)kGPIO_InterruptA);
    /* Initialize GPIO25 functionality on pin GPIO_25 (pin E7) */
    IO_MUX_SetPinMux(IO_MUX_GPIO25);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitNETPins:
- options: {callFromInitBoot: 'false', prefix: BOARD_, coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: B13, peripheral: ENET, signal: ENET_MDIO, pin_signal: GPIO_57}
  - {pin_num: E7, peripheral: ENET, signal: ENET_REF_CLK, pin_signal: GPIO_25, identifier: ''}
  - {pin_num: B6, peripheral: ENET, signal: 'ENET_RX_DATA, 0', pin_signal: GPIO_22}
  - {pin_num: B5, peripheral: ENET, signal: 'ENET_RX_DATA, 1', pin_signal: GPIO_23}
  - {pin_num: G11, peripheral: ENET, signal: 'ENET_TX_DATA, 0', pin_signal: GPIO_58}
  - {pin_num: D12, peripheral: ENET, signal: 'ENET_TX_DATA, 1', pin_signal: GPIO_59}
  - {pin_num: H4, peripheral: GPIO, signal: 'PIO0, 21', pin_signal: GPIO_21, direction: OUTPUT, gpio_init_state: 'true'}
  - {pin_num: K6, peripheral: GPIO, signal: 'PIO1, 23', pin_signal: GPIO_55, direction: INPUT}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitNETPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 */
void BOARD_InitNETPins(void)
{
    /* Enables the clock for the GPIO0 module */
    CLOCK_EnableClock(kCLOCK_HsGpio0);
    /* Enables the clock for the GPIO1 module */
    GPIO_PortInit(GPIO, 1);

    gpio_pin_config_t gpio0_pinH4_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO0_21 (pin H4)  */
    GPIO_PinInit(GPIO, 0U, 21U, &gpio0_pinH4_config);

    gpio_pin_config_t gpio1_pinK6_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_23 (pin K6)  */
    GPIO_PinInit(GPIO, 1U, 23U, &gpio1_pinK6_config);
    /* Initialize ENET_CLK functionality on pin GPIO_25 (pin E7) */
    IO_MUX_SetPinMux(IO_MUX_ENET_CLK);
    /* Initialize ENET_RX functionality on pin GPIO_22, GPIO_23 (pin B6_B5) */
    IO_MUX_SetPinMux(IO_MUX_ENET_RX);
    /* Initialize ENET_TX functionality on pin GPIO_58, GPIO_59 (pin G11_D12) */
    IO_MUX_SetPinMux(IO_MUX_ENET_TX);
    /* Initialize ENET_MDIO functionality on pin GPIO_57 (pin B13) */
    IO_MUX_SetPinMux(IO_MUX_ENET_MDIO);
    /* Initialize GPIO21 functionality on pin GPIO_21 (pin H4) */
    IO_MUX_SetPinMux(IO_MUX_GPIO21);
    /* Initialize GPIO55 functionality on pin GPIO_55 (pin K6) */
    IO_MUX_SetPinMux(IO_MUX_GPIO55);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitUSBPins:
- options: {callFromInitBoot: 'false', prefix: BOARD_, coreID: cm33, enableClock: 'true'}
- pin_list: []
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

