nxp-mcuxpresso/mcuxsdk-examples/_boards/rdrw612bga/common/pin_mux/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitUSBPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 */
void BOARD_InitUSBPins(void)
{
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitSPIPins:
- options: {callFromInitBoot: 'false', prefix: BOARD_, coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: C13, peripheral: FLEXCOMM0, signal: SPI_MISO, pin_signal: GPIO_3, pull_up_down: disable}
  - {pin_num: M1, peripheral: FLEXCOMM0, signal: SPI_SSELN0, pin_signal: GPIO_0, pull_up_down: disable}
  - {pin_num: F8, peripheral: FLEXCOMM0, signal: SPI_SCK, pin_signal: GPIO_4, pull_up_down: disable}
  - {pin_num: F10, peripheral: FLEXCOMM0, signal: SPI_MOSI, pin_signal: GPIO_2, pull_up_down: disable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitSPIPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 */
void BOARD_InitSPIPins(void)
{
    /* Initialize FC0_SPI_SS0 functionality on pin GPIO_3, GPIO_0, GPIO_4, GPIO_2 (pin C13_M1_F8_F10) */
    IO_MUX_SetPinMux(IO_MUX_FC0_SPI_SS0);
    /* Set GPIO_0 (pin C13_M1_F8_F10) configuration - Disable pull-up / pull-down; strongest slew rate */
    IO_MUX_SetPinConfig(0U, IO_MUX_PinConfigNoPull);
    /* Set GPIO_2 (pin C13_M1_F8_F10) configuration - Disable pull-up / pull-down; strongest slew rate */
    IO_MUX_SetPinConfig(2U, IO_MUX_PinConfigNoPull);
    /* Set GPIO_3 (pin C13_M1_F8_F10) configuration - Disable pull-up / pull-down; strongest slew rate */
    IO_MUX_SetPinConfig(3U, IO_MUX_PinConfigNoPull);
    /* Set GPIO_4 (pin C13_M1_F8_F10) configuration - Disable pull-up / pull-down; strongest slew rate */
    IO_MUX_SetPinConfig(4U, IO_MUX_PinConfigNoPull);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitI2CPins:
- options: {callFromInitBoot: 'false', prefix: BOARD_, coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: H2, peripheral: FLEXCOMM2, signal: I2C_SCL, pin_signal: GPIO_17}
  - {pin_num: J3, peripheral: FLEXCOMM2, signal: I2C_SDA, pin_signal: GPIO_16}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitI2CPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 */
void BOARD_InitI2CPins(void)
{
    /* Initialize FC2_I2C_16_17 functionality on pin GPIO_17, GPIO_16 (pin H2_J3) */
    IO_MUX_SetPinMux(IO_MUX_FC2_I2C_16_17);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitFLASHPins:
- options: {callFromInitBoot: 'false', prefix: BOARD_, coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: F4, peripheral: FLEXSPI, signal: FLASH_SSEL0, pin_signal: GPIO_28}
  - {pin_num: E3, peripheral: FLEXSPI, signal: FLASH_CLK0, pin_signal: GPIO_34}
  - {pin_num: F2, peripheral: FLEXSPI, signal: FLASH_DATA2, pin_signal: GPIO_32}
  - {pin_num: G3, peripheral: FLEXSPI, signal: FLASH_DATA3, pin_signal: GPIO_33}
  - {pin_num: D2, peripheral: FLEXSPI, signal: FLASH_DQS, pin_signal: GPIO_29}
  - {pin_num: D3, peripheral: FLEXSPI, signal: FLASH_DATA1, pin_signal: GPIO_31}
  - {pin_num: F3, peripheral: FLEXSPI, signal: FLASH_DATA0, pin_signal: GPIO_30}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitFLASHPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 */
void BOARD_InitFLASHPins(void)
{
    /* Initialize QUAD_SPI_FLASH functionality on pin GPIO_28, GPIO_34, GPIO_32, GPIO_33, GPIO_29, GPIO_31, GPIO_30
     * (pin F4_E3_F2_G3_D2_D3_F3) */
    IO_MUX_SetPinMux(IO_MUX_QUAD_SPI_FLASH);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPSRAMPins:
- options: {callFromInitBoot: 'false', prefix: BOARD_, coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: B3, peripheral: FLEXSPI, signal: SRAM_CLK0, pin_signal: GPIO_35}
  - {pin_num: B2, peripheral: FLEXSPI, signal: SRAM_DQS, pin_signal: GPIO_37, pull_up_down: down}
  - {pin_num: B1, peripheral: FLEXSPI, signal: SRAM_DATA3, pin_signal: GPIO_41}
  - {pin_num: A1, peripheral: FLEXSPI, signal: SRAM_DATA2, pin_signal: GPIO_40}
  - {pin_num: B4, peripheral: FLEXSPI, signal: SRAM_SSEL0, pin_signal: GPIO_36}
  - {pin_num: C3, peripheral: FLEXSPI, signal: SRAM_DATA0, pin_signal: GPIO_38}
  - {pin_num: A2, peripheral: FLEXSPI, signal: SRAM_DATA1, pin_signal: GPIO_39}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPSRAMPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 */
void BOARD_InitPSRAMPins(void)
{
    /* Initialize QUAD_SPI_PSRAM functionality on pin GPIO_35, GPIO_37, GPIO_41, GPIO_40, GPIO_36, GPIO_38, GPIO_39
     * (pin B3_B2_B1_A1_B4_C3_A2) */
    IO_MUX_SetPinMux(IO_MUX_QUAD_SPI_PSRAM);
    /* Set GPIO_37 (pin B3_B2_B1_A1_B4_C3_A2) configuration - Enable pull-down; strongest slew rate */
    IO_MUX_SetPinConfig(37U, IO_MUX_PinConfigPullDown);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
